require 'json'

array_of_hashes = [
  
  {
    'name': ['Назва', ' Башмак НКЗ', '10', '101', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', '1'],
    'purchase_price_$': ['Ціна закуп $', '300'],
    'personal_data': {
        'area': ['Площа покриття (м2)' ,'1'],
        'metal_thickness': ['Товшина металу (мм)' ,'2']
    },
    'weight': ['Вага', '20'],
    'dimensions': {
        'height': ['Висота', '600'],
        'length': ['Довжина, Вильот', '600'],
        'width': ['Ширина, Габарит', '150'],
        'diam': ['Діаметер', '']
    ,
        'thickness':  ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agtohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', 'шт'],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},

{
    'name': ['Назва', ' Барабан НКЗ', '10 (стрічковий)', '102', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', '1'],
    'purchase_price_$': ['Ціна закуп $', '100'],
    'personal_data': {
        'diameter': ['ДІаметер барабану' ,'240'],
        'type': ['Тип барабану' ,'стрічковий'],
        'price_footing': ['Ціна футування', '20']
    },
    'weight': ['Вага', '20'],
    'dimensions': {
        'height': ['Висота', '240'],
        'length': ['Довжина, Вильот', '240'],
        'width': ['Ширина, Габарит', '150'],
        'diam': ['Діаметер', '240'],
        'thickness':  ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', ''],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},

{
    'name': ['Назва', ' Головка НКЗ', '10', '103', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', '1'],
    'purchase_price_$': ['Ціна закуп $', '100'],
    'personal_data': {
        'area': ['Площа покриття' ,'1'],
        'metal_thickness': ['Товшина металу' ,'2'],
        'price_footing': ['Ціна футування', '10']
    },
    'weight': ['Вага', '20'],
    'dimensions': {
        'height': ['Висота', '550'],
        'length': ['Довжина, Вильот', '600'],
        'width': ['Ширина, Габарит', '200'],
        'diam':  ['Діаметер', ''],
        'thickness': ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', ''],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},

{
    'name': ['Назва', ' Вал', 'Башмака НКЗ-10', '104', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', '1'],
    'purchase_price_$': ['Ціна закуп $', '100'],
    'personal_data': {
        'bearing': [],
        'material': ['Матеріал' ,'2'] # Сталь 45
    },
    'weight': ['Вага', '2'],
    'dimensions': {
        'height': ['Висота', ''],
    'length': ['Довжина, Вильот', '400'],
    'width': ['Ширина, Габарит', '50'],
        'diam':  ['Діаметер', ''],
        'thickness': ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', ''],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},

{
    'name': ['Назва', ' Вал', 'Головки НКЗ-10', '104', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', '1'],
    'purchase_price_$': ['Ціна закуп $', '100'],
    'personal_data': {
        'bearing': [], # дані посадочного місця підштпника
        'material': ['Матеріал' ,'2'], # Сталь 45
        'gearbox_seat': [[], "32"] # [] lists марок мотор редукторів що встановлюються на цей вал
    },
    'weight': ['Вага', '2'],
    'dimensions': {
        'height': ['Висота', ''],
        'length': ['Довжина, Вильот', '400'],
        'width': ['Ширина, Габарит', ''],
        'diam': ['Діаметер', '50'],
        'thickness':  ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', ''],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},
{
    'name': ['Назва', ' Вал', 'Головки привідний НКЗ-10 ', '104', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', '1'],
    'purchase_price_$': ['Ціна закуп $', '20'],
    'personal_data': {
        'bearing': [], # дані посадочного місця підштпника
        'material': ['Матеріал' ,'2'], # Сталь 45
        'gearbox_seat': [[], "32"] # [] lists марок мотор редукторів що встановлюються на цей вал
    },
    'weight': ['Вага', '2'],
    'dimensions': {
        'height': ['Висота', ''],
        'length': ['Довжина, Вильот', '400'],
        'width': ['Ширина, Габарит', '50'],
        'diam':  ['Діаметер', ''],
        'thickness': ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', 'шт'],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},

{
    'name': ['Назва', ' Вал', 'Башмака НКЗ-10', '104', '2'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', '1'],
    'purchase_price_$': ['Ціна закуп $', '20'],
    'personal_data': {
        'bearing': [],
        'material': ['Матеріал' ,'2'] # Сталь 45
    },
    'weight': ['Вага', '2'],
    'dimensions': {
        'height': ['Висота', ''],   
        'length': ['Довжина, Вильот', '400'],
        'width': ['Ширина, Габарит', '50'],
        'diam':  ['Діаметер', ''],
        'thickness': ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', 'шт'],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},

{
    'name': ['Назва', 'Стрічка', '125*3/2', '105', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', '1'],
    'purchase_price_$': ['Ціна закуп $', '20'],
    'personal_data': {
        'type_protection':['Тип захисту' ,''],
        'chevron': ['Шиврування' ,'']
    },
    'dimensions': {
    'weight': ['Вага', ''],
        'height': ['Висота', '4'],
        'length': ['Довжина, Вильот', ''],
        'width': ['Ширина, Габарит', '125'],
        'diam':  ['Діаметер', ''],
        'thickness': ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', ''],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},

{
    'name': ['Назва', 'Ланцюг', 'ТРД', '106', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', '1'],
    'purchase_price_$': ['Ціна закуп $', '20'],
    'personal_data': {
        'step': ['Крок', '38'],
        'type': ['Тип', ''],
        'Breaking_power': ['Розривна міць кілонютони', '5000']
    },
    'dimensions': {
        'weight': ['Вага', '2'],
        'height': ['Висота', ''],
        'length': ['Довжина, Вильот', ''],
        'width': ['Ширина, Габарит', ''],
        'diam':  ['Діаметер', ''],
        'thickness': ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', 'метр погонний'],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},

{
    'name': ['Назва', 'Ківш', '', '107', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', '1'],
    'purchase_price_$': ['Ціна закуп $', '3'],
    'personal_data': {
        'volume': ['Обєм', '0.002'],
        'material': ['Матеріал', 'Металевий'],
        'number holes': ['Кількість отворів', '2'],
        'type': ['Тип виконання', 'Зварний'],
        'width': ['Відстань між отворами', '90'],
        'metiz': ['Метиз', '']
    },
    'dimensions': {
    'weight': ['Вага', ''],
        'height': ['Висота', '170'],
        'length': ['Довжина, Вильот', '110'],
        'width': ['Ширина, Габарит', '110'],
        'diam':  ['Діаметер', ''],
        'thickness': ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', ''],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},

{
    'name': ['Назва', 'Метиз', '', '108', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', ''],
    'purchase_price_$': ['Ціна закуп $', ''],
    'personal_data': {
        'length': ['Довжина', ''],
    'carving': ['Різьба', ''],
    'type': ['Тип', '']
    },
    'dimensions': {
    'weight': ['Вага', ''],
        'height': ['Висота', ''],
        'length': ['Довжина, Вильот', ''],
        'width': ['Ширина, Габарит', ''],
        'diam':  ['Діаметер', ''],
        'thickness': ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', ''],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},

{
    'name': ['Назва', 'Шaхта норійна', '', '109', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', ''],
    'purchase_price_$': ['Ціна закуп $', ''],
    'personal_data': {
        'type': '',
    'metal thickness': ''
    },
    'dimensions': {
    'weight': ['Вага', ''],
        'height': ['Висота', ''],
        'length': ['Довжина, Вильот', ''],
        'width': ['Ширина, Габарит', ''],
        'diam':  ['Діаметер', ''],
        'thickness': ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', ''],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},


{
    'name': ['Назва', 'Двигун', '', '110', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', ''],
    'purchase_price_$': ['Ціна закуп $', ''],
    'personal_data': {
        'spin minute': ['Оберти на хвилинк', ''],
    'shaft diameter': ['Діаметер валу', ''],
    'kilowatt hours': ['Кіловат години', ''],
    'fastening': ['Кріплення', ''],
    'kilonewton': ['Кілонютони', '']
    },
    'dimensions': {
    'weight': ['Вага', ''],
        'height': ['Висота', ''],
        'length': ['Довжина, Вильот', ''],
        'width': ['Ширина, Габарит', ''],
        'diam':  ['Діаметер', ''],
        'thickness': ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', ''],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},


{
    'name': ['Назва', 'Мотор-редуктор', '', '111', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', ''],
    'purchase_price_$': ['Ціна закуп $', ''],
    'personal_data': {
        'type gearbox': ['Тип редуктора', ''],
    'dimension': ['Габарит', ''],
    'service factor': ['Сервіс фактор', ''],
    'gear ratio': ['Передаточне число', ''],
    'type shaft': ['Вид валу', ''],
    'kilowatt hours': ['Кловат години', ''],
    'engine revolutions': ['Оберти двигуна', ''],
    'kilonewtons': ['Кілонютони', ''],
    'diam shaft': ['Діаметр валу', '']
    },
    'dimensions': {
    'weight': ['Вага', ''],
        'height': ['Висота', ''],
        'length': ['Довжина, Вильот', ''],
        'width': ['Ширина, Габарит', ''],
        'diam':  ['Діаметер', ''],
        'thickness': ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', ''],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},


{
    'name': ['Назва', 'Муфта', '', '112', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', ''],
    'purchase_price_$': ['Ціна закуп $', ''],
    'personal_data': {
        'shaft diameter': ['Даметр валу', ''],
    'dullness': ['Потужність', ''],
    'type': ['Тип', '']
    },
    'dimensions': {
    'weight': ['Вага', ''],
        'height': ['Висота', ''],
        'length': ['Довжина, Вильот', ''],
        'width': ['Ширина, Габарит', ''],
        'diam':  ['Діаметер', ''],
        'thickness': ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', ''],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},

{
    'name': ['Назва', 'Муфта', '', '113', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', ''],
    'purchase_price_$': ['Ціна закуп $', ''],
    'personal_data': {
        'shaft diameter': ['Даметр валу', ''],
        'dullness': ['Потужність', ''],
        'type': ['Тип', '']
    },
    'dimensions': {
    'weight': ['Вага', ''],
        'height': ['Висота', ''],
        'length': ['Довжина, Вильот', ''],
        'width': ['Ширина, Габарит', ''],
        'diam':  ['Діаметер', ''],
        'thickness': ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', ''],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},

{
    'name': ['Назва', 'Гальма', '', '114', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', ''],
    'purchase_price_$': ['Ціна закуп $', ''],
    'personal_data': {
        'dullness': ['Потужність', '']
    },
    'dimensions': {
        'height': ['Висота', ''],
        'length': ['Довжина, Вильот', ''],
        'width': ['Ширина, Габарит', ''],
        'diam':  ['Діаметер', ''],
        'thickness': ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', ''],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},

{
    'name': ['Назва', 'Засувка', '', '115', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', ''],
    'purchase_price_$': ['Ціна закуп $', ''],
    'personal_data': {
        'type': ['Тип', ''],    
        'drive': ['Привід', '']
    },
    'dimensions': {
    'weight': ['Вага', ''],
        'height': ['Висота', ''],
        'length': ['Довжина, Вильот', ''],
        'width': ['Ширина, Габарит', ''],
        'diam':  ['Діаметер', ''],
        'thickness': ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', ''],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},

{
    'name': ['Назва', 'Підщипник', '', '116', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', ''],
    'purchase_price_$': ['Ціна закуп $', ''],
    'personal_data': {
        'type': ['Тип', ''],
        'protection': ['Захист', ''],
    },
    'dimensions': {
    'weight': ['Вага', ''],
        'height': ['Висота', ''],
        'length': ['Довжина, Вильот', ''],
        'width': ['Ширина, Габарит', ''],
        'diam':  ['Діаметер', ''],
        'thickness': ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', ''],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},

{
    'name': ['Назва', 'ПІдшипник корпусний', '', '117', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', ''],
    'purchase_price_$': ['Ціна закуп $', ''],
    'personal_data': {
        'body type': ['Тип корпосу', ''],
        'protection': ['захист', ''],
        'bearing type': ['тип підшипника', ''],
        'number': ['Номер', '']
    },
    'dimensions': {
    'weight': ['Вага', ''],
        'height': ['Висота', ''],
        'length': ['Довжина, Вильот', ''],
        'width': ['Ширина, Габарит', ''],
        'diam':  ['Діаметер', ''],
        'thickness': ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', ''],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
},

{
    'name': ['Назва', 'Контерпривід', '', '118', '1'],
    'description': ['Опис', ''],
    'kof_markup': ['Коф націнкки', ''],
    'purchase_price_$': ['Ціна закуп $', ''],
    'personal_data': {

    },
    'dimensions': {
        'weight': ['Вага', ''],
        'height': ['Висота', ''],
        'length': ['Довжина, Вильот', ''],
        'width': ['Ширина, Габарит', ''],
        'diam':  ['Діаметер', ''],
        'thickness': ['товщина', '']
    },
    'tags': ['Теги', ["НКЗ-10"]],
    'photo': ['Фото', []],
    'logo': ['Лого', []],
    'links_drawing': ['Креслення', [[], [], []]]  #[Робочі], [Паспорт], [Для клвєнта]],
    'producer': ['Виробник', 'Agrohelix'],
    'shipping_dimensions': ['Габарити для відправки', ''],
    'unit': ['Одиниця виміру', ''],
    'location_warehouse': ['Місце знаходження на складі', ''],
    'group_crm': ['Гуппа срм',  []],
    'other_data': []
}

]

json_data = JSON.generate(array_of_hashes)
puts json_data
