[
    {
        'name': ['Назва', ' Башмак НКЗ-10', '', '101', ''],
        'description': ['Опис', ''],
        'kof_markup': ['Коф націнкки', ''],
        'purchase_price_₴': ['Ціна закуп ₴', ''],
        'personal_data': {
            'area': ['Площа покриття (м2)' ,'1'],
            'metal_thickness': ['Товшина металу (мм)' ,'2']
        },
        'weight': ['Вага', '20'],
        'dimensions': {
            'height': ['Висота', '1000'],
            'length': ['Довжина, Вильот', '400'],
            'width': ['Ширина, Габарит', '50'],
            'diam': ['Діаметер', '']
            },
        'tags': ['Теги', []],
        'photo': ['Фото', []],
        'logo': ['Лого', []],
        'links_drawing': ['Креслення', []],
        'producer': ['Виробник', ''],
        'shipping_dimensions': ['Габарити для відправки', ''],
        'unit': ['Одиниця виміру', ''],
        'location_warehouse': ['Місце знаходження на складі', ''],
        'group_crm': ['Гуппа срм', ''],
        'other_data': []
    },

    {
        'name': ['Назва', ' Барабан НКЗ', '', '102', ''],
        'description': ['Опис', ''],
        'kof_markup': ['Коф націнкки', ''],
        'purchase_price_₴': ['Ціна закуп ₴', ''],
        'personal_data': {
            'diameter': ['ДІаметер барабану' ,'1'],
            'type': ['Тип барабану' ,'2'],
            'price_footing': ['Ціна футування', '']
        },
        'weight': ['Вага', '20'],
        'dimensions': {
            'height' ['Висота', '1000'],
            'length': ['Довжина, Вильот', '400'],
            'width': ['Ширина, Габарит', '50'],,
            'diam': ['Діаметер', '']
        },
        'tags': ['Теги', []],
        'photo': ['Фото', []],
        'logo': ['Лого', []],
        'links_drawing': ['Креслення', []],
        'producer': ['Виробник', ''],
        'shipping_dimensions': ['Габарити для відправки', ''],
        'unit': ['Одиниця виміру', ''],
        'location_warehouse': ['Місце знаходження на складі', ''],
        'group_crm': ['Гуппа срм', ''],
        'other_data': []
    },

    {
        'name': ['Назва', ' Головка НКЗ-10', '', '103', ''],
        'description': ['Опис', ''],
        'kof_markup': ['Коф націнкки', ''],
        'purchase_price_₴': ['Ціна закуп ₴', ''],
        'personal_data': {
            'area': ['Площа покриття' ,'1'],
            'metal_thickness': ['Товшина металу' ,'2'],
            'price_footing': ['Ціна футування', '']
        },
        'weight': ['Вага', '20'],
        'dimensions': {
            'height' ['Висота', '1000'],
            'length': ['Довжина, Вильот', '400'],
            'width': ['Ширина, Габарит', '50'],,
            'diam': ['Діаметер', '']
        },
        'tags': ['Теги', []],
        'photo': ['Фото', []],
        'logo': ['Лого', []],
        'links_drawing': ['Креслення', []],
        'producer': ['Виробник', ''],
        'shipping_dimensions': ['Габарити для відправки', ''],
        'unit': ['Одиниця виміру', ''],
        'location_warehouse': ['Місце знаходження на складі', ''],
        'group_crm': ['Гуппа срм', ''],
        'other_data': []
    },

    {
        'name': ['Назва', ' Вал', '', '104', ''],
        'description': ['Опис', ''],
        'kof_markup': ['Коф націнкки', ''],
        'purchase_price_₴': ['Ціна закуп ₴', ''],
        'personal_data': {
            'bearing_diatheter': ['Діаметр підшипника', '1'],
        'material': ['Матеріал' ,'2']
        },
        'weight': ['Вага', '20'],
        'dimensions': {
            'height' ['Висота', '1000'],
        'length': ['Довжина, Вильот', '400'],
        'width': ['Ширина, Габарит', '50'],,
            'diam': ['Діаметер', '']
        },
        'tags': ['Теги', []],
        'photo': ['Фото', []],
        'logo': ['Лого', []],
        'links_drawing': ['Креслення', []],
        'producer': ['Виробник', ''],
        'shipping_dimensions': ['Габарити для відправки', ''],
        'unit': ['Одиниця виміру', ''],
        'location_warehouse': ['Місце знаходження на складі', ''],
        'group_crm': ['Гуппа срм', ''],
        'other_data': []
    },

    {
        'name': ['Назва', 'Стрічка'],
        'description': ['Опис', ''],
        'kof_markup': ['Коф націнкки', ''],
        'purchase_price_₴': ['Ціна закуп ₴', ''],
        'personal_data': {
            'step': ['Крок', ''],
        'type': ['Тип', '']
        },
        'dimensions': {
        'weight': ['Вага', ''],
            'height' ['Висота', ''],
            'length': ['Довжина, Вильот', ''],
            'width': ['Ширина, Габарит', ''],,
            'diam': ['Діаметер', '']
        },
        'tags': ['Теги', []],
        'photo': ['Фото', []],
        'logo': ['Лого', []],
        'links_drawing': ['Креслення', []],
        'producer': ['Виробник', ''],
        'shipping_dimensions': ['Габарити для відправки', ''],
        'unit': ['Одиниця виміру', ''],
        'location_warehouse': ['Місце знаходження на складі', ''],
        'group_crm': ['Гуппа срм', ''],
        'other_data': []
    },

    {
        'name': ['Назва', 'Ланцюг', '', '106', ''],
        'description': ['Опис', ''],
        'kof_markup': ['Коф націнкки', ''],
        'purchase_price_₴': ['Ціна закуп ₴', ''],
        'personal_data': {
            'step': ['Крок', ''],
        'type': ['Тип', '']
        },
        'dimensions': {
        'weight': ['Вага', ''],
            'height' ['Висота', ''],
            'length': ['Довжина, Вильот', ''],
            'width': ['Ширина, Габарит', ''],,
            'diam': ['Діаметер', '']
        },
        'tags': ['Теги', []],
        'photo': ['Фото', []],
        'logo': ['Лого', []],
        'links_drawing': ['Креслення', []],
        'producer': ['Виробник', ''],
        'shipping_dimensions': ['Габарити для відправки', ''],
        'unit': ['Одиниця виміру', ''],
        'location_warehouse': ['Місце знаходження на складі', ''],
        'group_crm': ['Гуппа срм', ''],
        'other_data': []
    },

    {
        'name': ['Назва', 'Ківш'],
        'description': ['Опис', ''],
        'kof_markup': ['Коф націнкки', ''],
        'purchase_price_₴': ['Ціна закуп ₴', ''],
        'personal_data': {
            'volume': ['Обєм', ''],
            'material': ['Матеріал', ''],
            'number holes': ['Кількість отворів', ''],
            'type': ['Тип виконання', ''],
            'distance_between_holes': ['Відстань між отворами', ''],
            'metiz': ['Метиз', ''],
            'thickness_base': ['Товщина основи', ''],
            'thickness_wall': ['Товщина стінка', '']
        },
        'dimensions': {
        'weight': ['Вага', ''],
            'height' ['Висота', ''],
            'length': ['Довжина, Вильот', ''],
            'width': ['Ширина, Габарит', ''],,
            'diam': ['Діаметер', '']
        },
        'tags': ['Теги', []],
        'photo': ['Фото', []],
        'logo': ['Лого', []],
        'links_drawing': ['Креслення', []],
        'producer': ['Виробник', ''],
        'shipping_dimensions': ['Габарити для відправки', ''],
        'unit': ['Одиниця виміру', ''],
        'location_warehouse': ['Місце знаходження на складі', ''],
        'group_crm': ['Гуппа срм', ''],
        'other_data': []
    },

    {
        'name': ['Назва', 'Метиз'],
        'description': ['Опис', ''],
        'kof_markup': ['Коф націнкки', ''],
        'purchase_price_₴': ['Ціна закуп ₴', ''],
        'personal_data': {
            'length': ['Довжина', ''],
        'carving': ['Різьба', ''],
        'type': ['Тип', '']
        },
        'dimensions': {
        'weight': ['Вага', ''],
            'height' ['Висота', ''],
            'length': ['Довжина, Вильот', ''],
            'width': ['Ширина, Габарит', ''],,
            'diam': ['Діаметер', '']
        },
        'tags': ['Теги', []],
        'photo': ['Фото', []],
        'logo': ['Лого', []],
        'links_drawing': ['Креслення', []],
        'producer': ['Виробник', ''],
        'shipping_dimensions': ['Габарити для відправки', ''],
        'unit': ['Одиниця виміру', ''],
        'location_warehouse': ['Місце знаходження на складі', ''],
        'group_crm': ['Гуппа срм', ''],
        'other_data': []
    },

    {
        'name': ['Назва', 'Шaхта норійна'],
        'description': ['Опис', ''],
        'kof_markup': ['Коф націнкки', ''],
        'purchase_price_₴': ['Ціна закуп ₴', ''],
        'personal_data': {
            'type': '',
        'metal thickness': ''
        },
        'dimensions': {
        'weight': ['Вага', ''],
            'height' ['Висота', ''],
            'length': ['Довжина, Вильот', ''],
            'width': ['Ширина, Габарит', ''],,
            'diam': ['Діаметер', '']
        },
        'tags': ['Теги', []],
        'photo': ['Фото', []],
        'logo': ['Лого', []],
        'links_drawing': ['Креслення', []],
        'producer': ['Виробник', ''],
        'shipping_dimensions': ['Габарити для відправки', ''],
        'unit': ['Одиниця виміру', ''],
        'location_warehouse': ['Місце знаходження на складі', ''],
        'group_crm': ['Гуппа срм', ''],
        'other_data': []
    },


    {
        'name': ['Назва', 'Двигун'],
        'description': ['Опис', ''],
        'kof_markup': ['Коф націнкки', ''],
        'purchase_price_₴': ['Ціна закуп ₴', ''],
        'personal_data': {
            'spin minute': ['Оберти на хвилинк', ''],
        'shaft diameter': ['Діаметер валу', ''],
        'kilowatt hours': ['Кіловат години', ''],
        'fastening': ['Кріплення', ''],
        'kilonewton': ['Кілонютони', '']
        },
        'dimensions': {
        'weight': ['Вага', ''],
            'height' ['Висота', ''],
            'length': ['Довжина, Вильот', ''],
            'width': ['Ширина, Габарит', ''],,
            'diam': ['Діаметер', '']
        },
        'tags': ['Теги', []],
        'photo': ['Фото', []],
        'logo': ['Лого', []],
        'links_drawing': ['Креслення', []],
        'producer': ['Виробник', ''],
        'shipping_dimensions': ['Габарити для відправки', ''],
        'unit': ['Одиниця виміру', ''],
        'location_warehouse': ['Місце знаходження на складі', ''],
        'group_crm': ['Гуппа срм', ''],
        'other_data': []
    },


    {
        'name': ['Назва', 'Мотор-редуктор'],
        'description': ['Опис', ''],
        'kof_markup': ['Коф націнкки', ''],
        'purchase_price_₴': ['Ціна закуп ₴', ''],
        'personal_data': {
            'type gearbox': ['Тип редуктора', ''],
        'dimension': ['Габарит', ''],
        'service factor': ['Сервіс фактор', ''],
        'gear ratio' : ['Передаточне число', ''],
        'type shaft': ['Вид валу', ''],
        'kilowatt hours': ['Кловат години', ''],
        'engine revolutions': ['Оберти двигуна', ''],
        'kilonewtons': ['Кілонютони', ''],
        'diam shaft': ['Діаметр валу', '']
        },
        'dimensions': {
        'weight': ['Вага', ''],
            'height' ['Висота', ''],
            'length': ['Довжина, Вильот', ''],
            'width': ['Ширина, Габарит', ''],,
            'diam': ['Діаметер', '']
        },
        'tags': ['Теги', []],
        'photo': ['Фото', []],
        'logo': ['Лого', []],
        'links_drawing': ['Креслення', []],
        'producer': ['Виробник', ''],
        'shipping_dimensions': ['Габарити для відправки', ''],
        'unit': ['Одиниця виміру', ''],
        'location_warehouse': ['Місце знаходження на складі', ''],
        'group_crm': ['Гуппа срм', ''],
        'other_data': []
    },


    {
        'name': ['Назва', 'Муфта'],
        'description': ['Опис', ''],
        'kof_markup': ['Коф націнкки', ''],
        'purchase_price_₴': ['Ціна закуп ₴', ''],
        'personal_data': {
            'shaft diameter': ['Даметр валу', ''],
        'dullness': ['Потужність', ''],
        'type': ['Тип', '']
        },
        'dimensions': {
        'weight': ['Вага', ''],
            'height' ['Висота', ''],
            'length': ['Довжина, Вильот', ''],
            'width': ['Ширина, Габарит', ''],,
            'diam': ['Діаметер', '']
        },
        'tags': ['Теги', []],
        'photo': ['Фото', []],
        'logo': ['Лого', []],
        'links_drawing': ['Креслення', []],
        'producer': ['Виробник', ''],
        'shipping_dimensions': ['Габарити для відправки', ''],
        'unit': ['Одиниця виміру', ''],
        'location_warehouse': ['Місце знаходження на складі', ''],
        'group_crm': ['Гуппа срм', ''],
        'other_data': []
    },

    {
        'name': ['Назва', 'Муфта'],
        'description': ['Опис', ''],
        'kof_markup': ['Коф націнкки', ''],
        'purchase_price_₴': ['Ціна закуп ₴', ''],
        'personal_data': {
            'shaft diameter': ['Даметр валу', ''],
            'dullness': ['Потужність', ''],
            'type': ['Тип', '']
        },
        'dimensions': {
        'weight': ['Вага', ''],
            'height' ['Висота', ''],
            'length': ['Довжина, Вильот', ''],
            'width': ['Ширина, Габарит', ''],,
            'diam': ['Діаметер', '']
        },
        'tags': ['Теги', []],
        'photo': ['Фото', []],
        'logo': ['Лого', []],
        'links_drawing': ['Креслення', []],
        'producer': ['Виробник', ''],
        'shipping_dimensions': ['Габарити для відправки', ''],
        'unit': ['Одиниця виміру', ''],
        'location_warehouse': ['Місце знаходження на складі', ''],
        'group_crm': ['Гуппа срм', ''],
        'other_data': []
    },

    {
        'name': ['Назва', 'Гальма'],
        'description': ['Опис', ''],
        'kof_markup': ['Коф націнкки', ''],
        'purchase_price_₴': ['Ціна закуп ₴', ''],
        'personal_data': {
            'dullness': ['Потужність', '']
        },
        'dimensions': {
            'height' ['Висота', ''],
            'length': ['Довжина, Вильот', ''],
            'width': ['Ширина, Габарит', ''],,
            'diam': ['Діаметер', '']
        },
        'tags': ['Теги', []],
        'photo': ['Фото', []],
        'logo': ['Лого', []],
        'links_drawing': ['Креслення', []],
        'producer': ['Виробник', ''],
        'shipping_dimensions': ['Габарити для відправки', ''],
        'unit': ['Одиниця виміру', ''],
        'location_warehouse': ['Місце знаходження на складі', ''],
        'group_crm': ['Гуппа срм', ''],
        'other_data': []
    },

    {
        'name': ['Назва', 'Засувка'],
        'description': ['Опис', ''],
        'kof_markup': ['Коф націнкки', ''],
        'purchase_price_₴': ['Ціна закуп ₴', ''],
        'personal_data': {
            'type': ['Тип', ''],    
            'drive': ['Привід', '']
        },
        'dimensions': {
        'weight': ['Вага', ''],
            'height' ['Висота', ''],
            'length': ['Довжина, Вильот', ''],
            'width': ['Ширина, Габарит', ''],,
            'diam': ['Діаметер', '']
        },
        'tags': ['Теги', []],
        'photo': ['Фото', []],
        'logo': ['Лого', []],
        'links_drawing': ['Креслення', []],
        'producer': ['Виробник', ''],
        'shipping_dimensions': ['Габарити для відправки', ''],
        'unit': ['Одиниця виміру', ''],
        'location_warehouse': ['Місце знаходження на складі', ''],
        'group_crm': ['Гуппа срм', ''],
        'other_data': []
    },

    {
        'name': ['Назва', 'Підщипник'],
        'description': ['Опис', ''],
        'kof_markup': ['Коф націнкки', ''],
        'purchase_price_₴': ['Ціна закуп ₴', ''],
        'personal_data': {
            'type': ['Тип', ''],
            'protection': ['Захист', ''],
        },
        'dimensions': {
        'weight': ['Вага', ''],
            'height' ['Висота', ''],
            'length': ['Довжина, Вильот', ''],
            'width': ['Ширина, Габарит', ''],,
            'diam': ['Діаметер', '']
        },
        'tags': ['Теги', []],
        'photo': ['Фото', []],
        'logo': ['Лого', []],
        'links_drawing': ['Креслення', []],
        'producer': ['Виробник', ''],
        'shipping_dimensions': ['Габарити для відправки', ''],
        'unit': ['Одиниця виміру', ''],
        'location_warehouse': ['Місце знаходження на складі', ''],
        'group_crm': ['Гуппа срм', ''],
        'other_data': []
    },

    {
        'name': ['Назва', 'ПІдшипник корпусний','116_1'],
        'description': ['Опис', ''],
        'kof_markup': ['Коф націнкки', ''],
        'purchase_price_₴': ['Ціна закуп ₴', ''],
        'personal_data': {
            'body type': ['Тип корпосу', ''],
            'protection': ['захист', ''],
            'bearing type': ['тип підшипника', ''],
            'number': ['Номер', '']
        },
        'dimensions': {
        'weight': ['Вага', ''],
            'height' ['Висота', ''],
            'length': ['Довжина, Вильот', ''],
            'width': ['Ширина, Габарит', ''],,
            'diam': ['Діаметер', '']
        },
        'tags': ['Теги', []],
        'photo': ['Фото', []],
        'logo': ['Лого', []],
        'links_drawing': ['Креслення', []],
        'producer': ['Виробник', ''],
        'shipping_dimensions': ['Габарити для відправки', ''],
        'unit': ['Одиниця виміру', ''],
        'location_warehouse': ['Місце знаходження на складі', ''],
        'group_crm': ['Гуппа срм', ''],
        'other_data': []
    },

    {
        'name': ['Назва', 'Контерпривід','116_1'],
        'description': ['Опис', ''],
        'kof_markup': ['Коф націнкки', ''],
        'purchase_price_₴': ['Ціна закуп ₴', ''],
        'personal_data': {

        },
        'dimensions': {
            'weight': ['Вага', ''],
            'height': ['Висота', ''],
            'length': ['Довжина, Вильот', ''],
            'width': ['Ширина, Габарит', ''],
            'diam': ['Діаметер', '']
        },
        'tags': ['Теги', []],
        'photo': ['Фото', []],
        'logo': ['Лого', []],
        'links_drawing': ['Креслення', []],
        'producer': ['Виробник', ''],
        'shipping_dimensions': ['Габарити для відправки', ''],
        'unit': ['Одиниця виміру', ''],
        'location_warehouse': ['Місце знаходження на складі', ''],
        'group_crm': ['Гуппа срм', ''],
        'other_data': []
    }
]

